; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	thermograph0 - mode
	infrared2 - mode
	infrared4 - mode
	image3 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	Star6 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(supports instrument0 image3)
	(supports instrument0 infrared4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Star14 infrared1)
	(have_image Star15 thermograph0)
	(have_image Phenomenon16 infrared1)
	(have_image Star17 image3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon16 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 5
3. (turn_to satellite0 star6 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star6)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon16 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon16 instrument0 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 1 of 5
7. (turn_to satellite0 star14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star14)
   goals met: 2 of 5
8. (take_image satellite0 star14 instrument0 infrared1)
   added: (have_image star14 infrared1)
   goals met: 3 of 5
9. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 2 of 5
10. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 3 of 5
11. (turn_to satellite0 star14 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star14)
   goals met: 4 of 5
12. (turn_to satellite0 star17 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star17)
   goals met: 3 of 5
13. (take_image satellite0 star17 instrument0 image3)
   added: (have_image star17 image3)
   goals met: 4 of 5
14. (turn_to satellite0 star14 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star14)
   goals met: 5 of 5
